Tekla Open API Reference for Tekla Structures 2025
EmbeddedObjectAttributes Constructor
Overload List
Name | Description
EmbeddedObjectAttributes()
 Initializes a new instance of the EmbeddedObjectAttributes class that loads standard attributes.
EmbeddedObjectAttributes(String)
 Initializes a new instance of the EmbeddedObjectAttributes class that loads given attributes.
Top
See Also
Reference
EmbeddedObjectAttributes Class
Tekla.Structures.Drawing Namespace